## Plan Result (ithc_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 3 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_storage_account.diagnostics
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_account.diagnostics will be updated in-place
  ~ resource "azurerm_storage_account" "diagnostics" {
      ~ cross_tenant_replication_enabled   = false -> true
        id                                 = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Storage/storageAccounts/hmctssdsdiagithc"
        name                               = "hmctssdsdiagithc"
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc"
        name                    = "sdshmcts-ithc"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      ~ id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/objectId/a86663bc-6390-4e5f-84c1-b38862724a66" -> (known after apply)
      ~ object_id               = "a86663bc-6390-4e5f-84c1-b38862724a66" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      ~ id                                     = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/sds-platform-ithc-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsithc/providers/Microsoft.Authorization/roleAssignments/47d46867-30ae-0d6b-ef7c-2ace38f1a2cd" -> (known after apply)
      ~ name                                   = "47d46867-30ae-0d6b-ef7c-2ace38f1a2cd" -> (known after apply)
      ~ principal_id                           = "a86663bc-6390-4e5f-84c1-b38862724a66" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity has changed
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
        id                      = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/lz-ithc-rg/providers/Microsoft.Cdn/profiles/sdshmcts-ithc"
        name                    = "sdshmcts-ithc"
      ~ output                  = jsonencode(
          ~ {
              - identity = {
                  - principalId = "a86663bc-6390-4e5f-84c1-b38862724a66"
                  - tenantId    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                }
            }
        )
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":898,"Program":"tfcmt","SHA1":"","Target":"ithc_frontdoor - TerraformPlanApply","Vars":{}} -->